rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
/*******************************************************************************
 * platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
 *
 * This Source Code Form is subject to the terms of the Mozilla Public License, v. 2.0.
 * If a copy of the MPL was not distributed with this file, you can obtain one at
 * https://mozilla.org/MPL/2.0/.
 *
 * Copyright 2026 Roku Inc. All rights reserved.
 ******************************************************************************/

#include <lt/LTTypes.h>
#include <lt/core/LTStdlib.h>
#include <lt/core/LTCore.h>

#include "Esp32_Registers.h"
#include "Esp32_Irq.h"
#include "Esp32_SoC.h"
#include "Esp32s3SPIFlash.h"
#include "Esp32s3SPIFlashCache.h"

DEFINE_LTLOG_SECTION("esp32s3.spiflash");

/*******************************************************************************
 * consts
*******************************************************************************/
/*
 * These are properties of the flash chip rather than of the esp32s3.  The block
 * protect bits live in the low status byte and the quad enable bit in the high
 * one, which is why writing the low byte alone can clear QE on parts that
 * implement a one byte WRSR - hence the two byte write below.
 */
enum {
    kSPIFlashBP0            = 0x01u << 2,
    kSPIFlashBP1            = 0x01u << 3,
    kSPIFlashBP2            = 0x01u << 4,
    kSPIFlashWriteProtect   = kSPIFlashBP0 | kSPIFlashBP1 | kSPIFlashBP2,
};

/* Transfer granularity for the bounce buffers.  32 bytes matches the write
 * quantum the flash device unit advertises and the 16 byte multiple the ROM's
 * encrypted write demands */
enum {
    kWriteChunkBytes        = 32,
    kWriteChunkWords        = kWriteChunkBytes / 4,
    kReadChunkBytes         = 64,
    kReadChunkWords         = kReadChunkBytes / 4,
};

/*
 * The ROM's legacy read, write and erase routines send a 24 bit address, so on
 * a part larger than 16MB they silently wrap: a read of 0x1ffb000 comes back
 * with the contents of 0xffb000 and reports success.  Anything reaching at or
 * above this boundary therefore goes out with the four byte address command set
 * instead - see the Cmd4B helpers below.
 */
enum {
    k24BitAddressLimit      = 0x1000000u,
    kFlashPageSize          = 0x100u,
};

/*
 * Four byte address opcodes, and the plain JEDEC identify.
 *
 * These are the 4B command variants rather than the EN4B mode switch on
 * purpose.  EN4B puts the whole chip into four byte addressing, including the
 * path the cache uses to fetch instructions and rodata, which the bootloader
 * has already configured for three; the 4B opcodes carry the wide address in
 * the transaction alone and leave that path untouched.
 */
enum {
    kFlashCmd_ReadId        = 0x9f,
    kFlashCmd_FastRead4B    = 0x0c,
    kFlashCmd_PageProgram4B = 0x12,
    kFlashCmd_EraseSector4B = 0x21,
    kFlashCmd_EraseBlock4B  = 0xdc,
};

/* SPI1 port number for esp_rom_opiflash_exec_cmd(), and the read mode that
 * makes it drive a plain single line SPI transaction */
enum {
    kSpiPort_User           = 1,
    kRomSpiFlashMode_FastRd = 4,
    kCsMask_Flash           = 0x01,

    /* The MSPI data buffer a transaction reads from and writes back into is
     * W0 to W15, so no single transaction can move more than 64 bytes */
    kMSPI_DataBufferBytes   = 64,
};

/*******************************************************************************
 * ROM
*******************************************************************************/
typedef u32 Esp32s3SPIFlash_RomResult;
enum Esp32s3SPIFlash_RomResult {
    kEsp32s3SPIFlash_RomResult_OK       = 0,
    kEsp32s3SPIFlash_RomResult_Error    = 1,
    kEsp32s3SPIFlash_RomResult_Timeout  = 2,
};

/*
 * The esp32 kept the ROM's notion of the attached flash chip in a fixed global,
 * g_rom_spiflash_chip.  The esp32s3 ROM instead exports a pointer to a block
 * holding the chip description followed by the per-mode extra dummy cycle
 * counts; layout must match the ROM's spiflash_legacy_data_t.
 */
typedef struct {
    Esp32s3SPIFlash_Chip    chip;
    u8                      dummyLenPlus[3];
    u8                      sigMatrix;
} Esp32s3SPIFlash_LegacyData;

extern Esp32s3SPIFlash_LegacyData * rom_spiflash_legacy_data;

extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_read_status(Esp32s3SPIFlash_Chip * pChip, u32 * pStatus);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_read_statushigh(Esp32s3SPIFlash_Chip * pChip, u32 * pStatus);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_write_status(Esp32s3SPIFlash_Chip * pChip, u32 nStatus);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_wait_idle(Esp32s3SPIFlash_Chip * pChip);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_unlock(void);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_erase_chip(void);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_erase_block(u32 nBlockNumber);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_erase_sector(u32 nSectorNumber);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_write(u32 nDestAddr, const u32 * pSrc, s32 nLen);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_read(u32 nSrcAddr, u32 * pDest, s32 nLen);
extern Esp32s3SPIFlash_RomResult esp_rom_spiflash_write_encrypted(u32 nFlashAddr, u32 * pData, u32 nLen);
extern void esp_rom_spiflash_write_encrypted_enable(void);
extern void esp_rom_spiflash_write_encrypted_disable(void);

/*
 * The general purpose MSPI transaction driver.  The legacy API above is a set
 * of fixed transactions built on top of it; this is the raw form, and the only
 * way to send an opcode the legacy API has no entry point for.  The BSP's PSRAM
 * init drives CS1 with it - here it is CS0, the flash.
 *
 * nMode selects line count and data rate; kRomSpiFlashMode_FastRd is a plain
 * single line transfer.  bIsWriteEraseOperation is left false throughout and
 * the write enable and the wait for idle are done explicitly instead, so that
 * every step of a program or erase is visible here rather than in the ROM.
 */
extern void esp_rom_opiflash_exec_cmd(int nSpiNum, int nMode,
                                      u32 nCmd, int nCmdBitLen,
                                      u32 nAddr, int nAddrBitLen,
                                      int nDummyBits,
                                      u8 * pMosiData, int nMosiBitLen,
                                      u8 * pMisoData, int nMisoBitLen,
                                      u32 nCsMask,
                                      bool bIsWriteEraseOperation);

