rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
/*******************************************************************************
 * static variables
*******************************************************************************/
static bool s_bInited = false;

/*
 * Every static below that suspends the cache is ESP32_IRAM_FUNC rather than a
 * plain ESP32_MEM_REGION(IRAM), and must stay that way - a section attribute on
 * its own does not survive gcc inlining the function into a caller in flash,
 * and this file is where that was first found the hard way.  See the macro in
 * Esp32_SoC.h for the mechanism and for how to check the result:
 *
 *   xtensa-esp32s3-elf-nm -n LTFirmwareImage.elf | grep Esp32s3SPIFlash
 */

/* Forward declared because Esp32s3SPIFlash_Init() calls it; the attributes have
 * to be repeated here, since gcc applies a section attribute it first sees on
 * the definition only if nothing has already been emitted against the name */
static u32 ESP32_IRAM_FUNC Esp32s3SPIFlash_ReadChipSize(void);

/*******************************************************************************
 *
 * implementation
 *
*******************************************************************************/

static Esp32s3SPIFlash_Chip * GetChip(void) {
    return &rom_spiflash_legacy_data->chip;
}

/*******************************************************************************
 * Initializes the driver
 * Returns a pointer to the flash chip the bootloader configured
*******************************************************************************/
const Esp32s3SPIFlash_Chip * Esp32s3SPIFlash_Init(const char* pChipName) {
    LT_UNUSED(pChipName);

    /* The ROM populates this while loading the second stage bootloader; if it is
     * empty then nothing has configured the MSPI and there is nothing to talk to */
    if (rom_spiflash_legacy_data == NULL || GetChip()->chipSize == 0 || GetChip()->sectorSize == 0) {
        return NULL;
    }

    s_bInited = true;

    /*
     * The size the ROM is holding did not come from the chip.  The second stage
     * bootloader takes it from the flash size nibble of its own image header,
     * which is whatever esptool was told at mastering time, and hands it to
     * esp_rom_spiflash_config_param().  Get it wrong and everything past the
     * declared size is refused by the bounds checks below, which is how a
     * partition in the top of a 32MB part comes back unreadable on a board
     * mastered as 4MB.  esptool's image header cannot express more than 16MB in
     * any case, so ask the chip and believe the answer.
     */
    u32 nChipSize = Esp32s3SPIFlash_ReadChipSize();
    if (nChipSize != 0 && nChipSize != GetChip()->chipSize) {
        LTLOG_DEBUG("chip.size", "Flash is %lu MB, image header said %lu MB",
                   LT_Pu32(nChipSize / (1024 * 1024)), LT_Pu32(GetChip()->chipSize / (1024 * 1024)));
        GetChip()->chipSize = nChipSize;
    }

    return GetChip();
}

/*******************************************************************************
 * Checks if the driver has been initialized
*******************************************************************************/
static bool Esp32s3SPIFlash_IsInited(void) {
    return s_bInited;
}

/*******************************************************************************
 * Issue the hardware generated write enable command
 * @note the cache must be disabled before calling this function
*******************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_EnableWrite(void) {
    /* IRAM section begin - Code from here on must run from IRAM */

    if (esp_rom_spiflash_wait_idle(GetChip()) != kEsp32s3SPIFlash_RomResult_OK) {
        return false;
    }

    ESP32_SPIMEM_REG(1, CMD) = ESP32_REG_MASK(SPIMEM, CMD_FLASH_WREN);
    volatile u16 nTimeout = LT_U16_MAX;
    while (ESP32_SPIMEM_REG(1, CMD) != 0 && --nTimeout != 0);

    /* IRAM section end - Code from here on can run from flash */

    return (nTimeout != 0);
}

/*******************************************************************************
 * Send one single line transaction on SPI1 to the flash
 * @note the cache must be disabled before calling this function
*******************************************************************************/
static void ESP32_IRAM_FUNC Esp32s3SPIFlash_Cmd(u32 nCmd, u32 nAddr, int nAddrBits, int nDummyBits,
                                                const u32 * pMosi, u32 nMosiBytes,
                                                u32 * pMiso, u32 nMisoBytes) {
    /* The data buffer keeps whatever the last transaction left in it, and a
     * read only overwrites the words it fills, so a short read would otherwise
     * pick up the tail of the one before */
    if (nMisoBytes > 0) {
        volatile u32 * pW = &ESP32_SPIMEM_REG(1, W0);
        for (u32 i = 0; i < (kMSPI_DataBufferBytes / 4); ++i) {
            pW[i] = 0;
        }
    }

    esp_rom_opiflash_exec_cmd(kSpiPort_User, kRomSpiFlashMode_FastRd,
                              nCmd, 8,
                              nAddr, nAddrBits,
                              nDummyBits,
                              (u8 *)pMosi, (int)(nMosiBytes * 8),
                              (u8 *)pMiso, (int)(nMisoBytes * 8),
                              kCsMask_Flash,
                              false);
}

/*******************************************************************************
 * Read with a four byte address
 * nSize must be no more than the 64 byte MSPI data buffer
 * @note the cache must be disabled before calling this function
*******************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_Read4B(u32 nAddr, u32 * pWords, u32 nSize) {
    if (nSize == 0 || nSize > kMSPI_DataBufferBytes) {
        return false;
    }

    /* 0x0c is fast read, which spends eight cycles turning the bus around
     * before the first data byte */
    Esp32s3SPIFlash_Cmd(kFlashCmd_FastRead4B, nAddr, 32, 8, NULL, 0, pWords, nSize);
    return true;
}

