rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
/*******************************************************************************
 * Program with a four byte address
 * @note the cache must be disabled before calling this function
*******************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_Program4B(u32 nAddr, const u32 * pWords, u32 nSize) {
    const u8 * pBytes = (const u8 *)pWords;

    while (nSize > 0) {
        /* A page program that runs off the end of a 256 byte page wraps back to
         * the start of the same page rather than carrying into the next one */
        u32 nRoom  = kFlashPageSize - (nAddr & (kFlashPageSize - 1));
        u32 nCount = LT_MIN(nSize, LT_MIN(nRoom, (u32)kMSPI_DataBufferBytes));

        if (!Esp32s3SPIFlash_EnableWrite()) {
            return false;
        }

        Esp32s3SPIFlash_Cmd(kFlashCmd_PageProgram4B, nAddr, 32, 0, (const u32 *)pBytes, nCount, NULL, 0);

        if (esp_rom_spiflash_wait_idle(GetChip()) != kEsp32s3SPIFlash_RomResult_OK) {
            return false;
        }

        pBytes += nCount;
        nAddr  += nCount;
        nSize  -= nCount;
    }

    return true;
}

/*******************************************************************************
 * Erase with a four byte address
 * @note the cache must be disabled before calling this function
*******************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_Erase4B(u32 nCmd, u32 nAddr) {
    if (!Esp32s3SPIFlash_EnableWrite()) {
        return false;
    }

    Esp32s3SPIFlash_Cmd(nCmd, nAddr, 32, 0, NULL, 0, NULL, 0);

    return (esp_rom_spiflash_wait_idle(GetChip()) == kEsp32s3SPIFlash_RomResult_OK);
}

/*******************************************************************************
 * Ask the chip how big it is
 * Returns 0 if it answers with something that is not a size
*******************************************************************************/
static u32 ESP32_IRAM_FUNC Esp32s3SPIFlash_ReadChipSize(void) {
    u32 nId = 0;

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    Esp32s3SPIFlash_Cmd(kFlashCmd_ReadId, 0, 0, 0, NULL, 0, &nId, 3);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    /* JEDEC answers with the manufacturer, then the memory type, then the
     * capacity, and the bytes land in the data buffer in that order, so the
     * capacity is the third one.  Every part this would be built against
     * encodes it as the log2 of the size in bytes */
    u32 nCapacity = (nId >> 16) & 0xffu;
    if (nCapacity < 20 || nCapacity > 26) {   /* 1MB to 64MB */
        return 0;
    }

    return 1u << nCapacity;
}

/*******************************************************************************
 * Unlock the flash
 * The flash chips support protecting a range of blocks or predefined blocks, but
 * does not support specific individual blocks
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_WriteUnprotect(void) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    /* The ROM routine knows which vendors keep their protect bits where, and
     * preserves the quad enable bit, so there is no reason to hand roll this */
    bool bSuccess = (esp_rom_spiflash_unlock() == kEsp32s3SPIFlash_RomResult_OK);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * Lock the flash
 * @note esp_rom_spiflash_lock() is declared by the ROM headers but is not one of
 * the entry points the esp32s3 ROM exports, so the sequence is open coded here
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_WriteProtect(void) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    /* read_statushigh returns the second status byte already shifted into
     * position, so the two halves can simply be ored together */
    u32 nStatus     = 0;
    u32 nStatusHigh = 0;
    bool bSuccess = (esp_rom_spiflash_read_status(GetChip(), &nStatus) == kEsp32s3SPIFlash_RomResult_OK)
                 && (esp_rom_spiflash_read_statushigh(GetChip(), &nStatusHigh) == kEsp32s3SPIFlash_RomResult_OK);

    if (bSuccess) {
        /* Send both status bytes.  A single byte WRSR would leave the quad
         * enable bit in the second byte undefined on some parts, which would
         * cost us the cached flash mapping we are running from */
        u32 nCtrl = ESP32_SPIMEM_REG(1, CTRL);
        ESP32_SPIMEM_REG(1, CTRL) = nCtrl | ESP32_REG_MASK(SPIMEM, CTRL_WRSR_2B);

        bSuccess = Esp32s3SPIFlash_EnableWrite();
        if (bSuccess) {
            bSuccess = (esp_rom_spiflash_write_status(GetChip(), nStatusHigh | kSPIFlashWriteProtect)
                            == kEsp32s3SPIFlash_RomResult_OK);
        }

        ESP32_SPIMEM_REG(1, CTRL) = nCtrl;
    }

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * Returns whether the flash is locked or unlocked
 * @note the block protect bits are in the low status byte.  The esp32 driver
 * tests them against the high byte instead, which can never match
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_IsLocked(void) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    u32 nStatus = 0;

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

