rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
    bool bSuccess = (esp_rom_spiflash_read_status(GetChip(), &nStatus) == kEsp32s3SPIFlash_RomResult_OK);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return (bSuccess && (nStatus & kSPIFlashWriteProtect) != 0);
}

/*******************************************************************************
 * erase the entire flash
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_EraseChip(void) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    bool bSuccess = (esp_rom_spiflash_erase_chip() == kEsp32s3SPIFlash_RomResult_OK);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * erase a block
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_EraseBlock(u32 nBlockNumber) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    if (nBlockNumber >= (GetChip()->chipSize / GetChip()->blockSize)) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    u32 nAddr = nBlockNumber * GetChip()->blockSize;
    bool bSuccess = (nAddr >= k24BitAddressLimit)
                        ? Esp32s3SPIFlash_Erase4B(kFlashCmd_EraseBlock4B, nAddr)
                        : (esp_rom_spiflash_erase_block(nBlockNumber) == kEsp32s3SPIFlash_RomResult_OK);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/*******************************************************************************
 * erase a sector
*******************************************************************************/
bool ESP32_MEM_REGION(IRAM) Esp32s3SPIFlash_EraseSector(u32 nSectorNumber) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    if (nSectorNumber >= (GetChip()->chipSize / GetChip()->sectorSize)) {
        return false;
    }

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    u32 nAddr = nSectorNumber * GetChip()->sectorSize;
    bool bSuccess = (nAddr >= k24BitAddressLimit)
                        ? Esp32s3SPIFlash_Erase4B(kFlashCmd_EraseSector4B, nAddr)
                        : (esp_rom_spiflash_erase_sector(nSectorNumber) == kEsp32s3SPIFlash_RomResult_OK);

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/****************************************************************************
 * Returns whether flash encryption is enabled or not
 ****************************************************************************/
bool Esp32s3SPIFlash_IsEncryptionEnabled(void) {
    /* The esp32 reported this through EFUSE_BLK0_RDATA0.FLASH_CRYPT_CNT; the
     * esp32s3 renamed and moved it to RD_REPEAT_DATA1.SPI_BOOT_CRYPT_CNT, but
     * the odd parity convention is the same */
    u32 nCryptCount = (ESP32_REG(EFUSE_RD_REPEAT_DATA1) & ESP32_REG_MASK(EFUSE, SPI_BOOT_CRYPT_CNT))
                          >> ESP32_REG_SHIFT(EFUSE, SPI_BOOT_CRYPT_CNT);
    return __builtin_parity(nCryptCount);
}

/****************************************************************************
 * Reads straight off the flash, bypassing the cache, so encrypted content
 * comes back as it is stored (no alignment needed)
 ****************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_ReadDirect(u32 nAddr, u8 * pBuffer, u32 nSize) {
    /* The ROM read wants a word aligned address, length and destination, so
     * everything lands in a DRAM bounce buffer first */
    u32 nChunk[kReadChunkWords];
    bool bSuccess = true;

    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    while (nSize > 0 && bSuccess) {
        u32 nAligned = nAddr & ~0x3u;
        u32 nSkip    = nAddr - nAligned;
        u32 nWanted  = LT_MIN(nSize, (u32)kReadChunkBytes - nSkip);

        /* Never let one transaction cross the 16MB line, so that each is wholly
         * three byte addressed or wholly four */
        if (nAligned < k24BitAddressLimit && (nAddr + nWanted) > k24BitAddressLimit) {
            nWanted = k24BitAddressLimit - nAddr;
        }

        u32 nReadLen = (nSkip + nWanted + 3) & ~0x3u;

        if (nAligned >= k24BitAddressLimit) {
            bSuccess = Esp32s3SPIFlash_Read4B(nAligned, nChunk, nReadLen);
        } else {
            bSuccess = (esp_rom_spiflash_read(nAligned, nChunk, (s32)nReadLen) == kEsp32s3SPIFlash_RomResult_OK);
        }
        if (bSuccess) {
            /* open coded so the copy stays in IRAM - lt_memcpy() is in flash */
            const u8 * pSrc = (const u8 *)nChunk + nSkip;
            for (u32 i = 0; i < nWanted; ++i) {
                pBuffer[i] = pSrc[i];
            }
            pBuffer += nWanted;
            nAddr   += nWanted;
            nSize   -= nWanted;
        }
    }

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/****************************************************************************
 * Reads through the cache so encrypted content is decrypted on the way
 * (no alignment needed)
 ****************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_ReadMapped(u32 nAddr, u8 * pBuffer, u32 nSize) {
    Esp32s3SPIFlash_MapInfo map;
    map.srcAddr = nAddr;
    map.size    = nSize;

    u32 mask = Esp32DisableInterrupts();
    /* IRAM section begin - Code from here on must run from IRAM */
    u32 state = Esp32s3SPIFlashCache_DisableCache();

    Esp32s3SPIFlashCache_Mmap(&map);

    Esp32s3SPIFlashCache_EnableCache(state);
    /* IRAM section end - Code from here on can run from flash */
    Esp32EnableInterrupts(mask);

    if (map.ptr == NULL) {
        LTLOG_YELLOWALERT("fail.read.map", "Failed to map the flash");
        return false;
    }

