rokudev/lt-sdk/lt/platforms/esp32/source/esp32/driver/flash/esp32s3/Esp32s3SPIFlash.c
    // cache must be enabled before calling lt_memcpy()
    lt_memcpy(pBuffer, map.ptr, nSize);

    mask = Esp32DisableInterrupts();
    /* IRAM section begin - Code from here on must run from IRAM */
    state = Esp32s3SPIFlashCache_DisableCache();

    Esp32s3SPIFlashCache_Ummap(&map);

    Esp32s3SPIFlashCache_EnableCache(state);
    /* IRAM section end - Code from here on can run from flash */
    Esp32EnableInterrupts(mask);

    return true;
}

/****************************************************************************
 * Read from the flash (no alignment needed)
 ****************************************************************************/
bool Esp32s3SPIFlash_Read(u32 nSrcAddr, u8 * pBuffer, u32 nSize, bool bDecrypt) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    if (nSize == 0) {
        return true;
    }

    if (nSrcAddr + nSize > GetChip()->chipSize) {
        return false;
    }

    if (bDecrypt) {
        if (!Esp32s3SPIFlash_IsEncryptionEnabled()) {
            // can't decrypt
            return false;
        }
        /* The cache fetches with the read command the bootloader configured,
         * which carries a three byte address, so the mapped path cannot reach
         * the top of a part larger than 16MB.  Refuse rather than hand back the
         * contents of the address it would wrap to */
        if (nSrcAddr + nSize > k24BitAddressLimit) {
            LTLOG_YELLOWALERT("dec.unreachable", "Cannot decrypt at 0x%lx - beyond the mapped 16MB", LT_Pu32(nSrcAddr));
            return false;
        }
        /* only the cached path decrypts */
        return Esp32s3SPIFlash_ReadMapped(nSrcAddr, pBuffer, nSize);
    }

    return Esp32s3SPIFlash_ReadDirect(nSrcAddr, pBuffer, nSize);
}

/****************************************************************************
 * Write one chunk of word aligned data
 * The caller has already staged the data in DRAM, because the source may
 * itself live in cached flash
 ****************************************************************************/
static bool ESP32_IRAM_FUNC Esp32s3SPIFlash_WriteChunk(u32 nAddr, const u32 * pWords, u32 nSize, bool bEncrypt) {
    u32 mask = Esp32DisableInterrupts();

    /* IRAM section begin - Code from here on must run from IRAM */

    u32 state = Esp32s3SPIFlashCache_DisableCache();

    bool bSuccess;
    if (bEncrypt) {
        esp_rom_spiflash_write_encrypted_enable();
        bSuccess = (esp_rom_spiflash_write_encrypted(nAddr, (u32 *)pWords, nSize) == kEsp32s3SPIFlash_RomResult_OK);
        esp_rom_spiflash_write_encrypted_disable();
    } else if (nAddr >= k24BitAddressLimit) {
        bSuccess = Esp32s3SPIFlash_Program4B(nAddr, pWords, nSize);
    } else {
        bSuccess = (esp_rom_spiflash_write(nAddr, pWords, (s32)nSize) == kEsp32s3SPIFlash_RomResult_OK);
    }

    Esp32s3SPIFlashCache_EnableCache(state);

    /* IRAM section end - Code from here on can run from flash */

    Esp32EnableInterrupts(mask);

    return bSuccess;
}

/****************************************************************************
 * Write word aligned data, staging it a chunk at a time
 * nAddr and nSize must be 4-byte aligned
 ****************************************************************************/
static bool Esp32s3SPIFlash_WriteAligned(u32 nAddr, const u8 * pBuffer, u32 nSize, bool bEncrypt) {
    bool bSuccess = true;

    while (nSize > 0 && bSuccess) {
        u32 nChunk[kWriteChunkWords];
        u32 nCount = LT_MIN(nSize, (u32)kWriteChunkBytes);

        /* Never let one chunk cross the 16MB line, so that each is wholly three
         * byte addressed or wholly four */
        if (nAddr < k24BitAddressLimit && (nAddr + nCount) > k24BitAddressLimit) {
            nCount = k24BitAddressLimit - nAddr;
        }

        // the source may be in cached flash, so stage it while the cache is up
        lt_memcpy(nChunk, pBuffer, nCount);

        bSuccess = Esp32s3SPIFlash_WriteChunk(nAddr, nChunk, nCount, bEncrypt);

        pBuffer += nCount;
        nAddr   += nCount;
        nSize   -= nCount;
    }

    return bSuccess;
}

/****************************************************************************
 * Write data to Flash (no alignment needed unless encrypting)
 ****************************************************************************/
bool Esp32s3SPIFlash_Write(u32 nAddr, const u8 * pBuffer, u32 nSize, bool bEncrypt) {
    if (!Esp32s3SPIFlash_IsInited()) {
        return false;
    }

    if (nSize == 0) {
        return true;
    }

    if (nAddr + nSize > GetChip()->chipSize) {
        return false;
    }

    if (bEncrypt) {
        if (!Esp32s3SPIFlash_IsEncryptionEnabled()) {
            LTLOG_YELLOWALERT("enc.disabled", "bEncrypt is set, but encryption is not enabled");
            return false;
        }
        if ((nAddr & 0x1f) || (nSize & 0xf)) {
            LTLOG_YELLOWALERT("invalid.enc.align", "Encryption data size must be 16-byte aligned and address must be 32-byte aligned");
            return false;
        }
        /* The ROM's encrypted write sends a three byte address and there is no
         * four byte address form of it to fall back on, since the encryption
         * happens inside the ROM routine */
        if (nAddr + nSize > k24BitAddressLimit) {
            LTLOG_YELLOWALERT("enc.unreachable", "Cannot encrypt at 0x%lx - beyond the addressable 16MB", LT_Pu32(nAddr));
            return false;
        }
        return Esp32s3SPIFlash_WriteAligned(nAddr, pBuffer, nSize, true);
    }

    bool bSuccess = true;

    /* leading partial word - read it back, patch it and rewrite the whole word */
    if (nAddr & 0x3) {
        u32 nAligned = nAddr & ~0x3u;
        u32 nOffset  = nAddr - nAligned;
        u32 nCount   = LT_MIN(nSize, (u32)sizeof(u32) - nOffset);
        u32 nWord    = LT_U32_MAX;

        bSuccess = Esp32s3SPIFlash_Read(nAligned, (u8 *)&nWord, sizeof(nWord), false);
        if (bSuccess) {
            lt_memcpy((u8 *)&nWord + nOffset, pBuffer, nCount);
            bSuccess = Esp32s3SPIFlash_WriteAligned(nAligned, (const u8 *)&nWord, sizeof(nWord), false);

            pBuffer += nCount;
            nAddr   += nCount;
            nSize   -= nCount;
        }
    }

    /* whole words */
    u32 nWholeWords = nSize & ~0x3u;
    if (bSuccess && nWholeWords > 0) {
        bSuccess = Esp32s3SPIFlash_WriteAligned(nAddr, pBuffer, nWholeWords, false);

        pBuffer += nWholeWords;
        nAddr   += nWholeWords;
        nSize   -= nWholeWords;
    }

    /* trailing partial word */
    if (bSuccess && nSize > 0) {
        u32 nWord = LT_U32_MAX;

        bSuccess = Esp32s3SPIFlash_Read(nAddr, (u8 *)&nWord, sizeof(nWord), false);
        if (bSuccess) {
            lt_memcpy(&nWord, pBuffer, nSize);
            bSuccess = Esp32s3SPIFlash_WriteAligned(nAddr, (const u8 *)&nWord, sizeof(nWord), false);
        }
    }

    return bSuccess;
}

/*******************************************************************************
 *  LOG
 *******************************************************************************
 *  29-Jul-26   claudius    created
 *  05-Aug-26   claudius    kept the cache suspending helpers out of flash with
 *                          LT_NOINLINE, now spelled ESP32_IRAM_FUNC
 *  05-Aug-26   claudius    took the chip size from the chip rather than from the
 *                          image header; reached past 16MB with four byte
 *                          address commands
 */
